{
    "PARAMS": {
        "-executionpolicy": "-ExecutionPolicy. Sets the default execution policy for the current session",
        "-NonInteractive": "-NonInteractive. Doesn't present an interactive prompt to the user.",
        "-Mta": "-Mta. Starts PowerShell using a multi-threaded apartment.",
        "-NoExit": "-NoExit. Doesn't exit after running startup commands.",
        "-NoLogo": "-NoLogo. Hides the copyright banner at startup.",
        "-NoProfile": "-NoProfile. Doesn't load the PowerShell profile.",
        "-WindowStyle": "-WindowStyle. Sets the window style for the session. Valid values are Normal, Minimized, Maximized, and Hidden.",
        "-Command": "-Command. Executes the specified commands",
        "-ec": "-ec. Truncated syntax for encodedcommand, it accepts a base-64-encoded data block version of a command.",
        "bypass": "bypass. Allows running of PowerShell scripts with no warnings or prompts.",
        "hidden": "hidden. Set the window style for this session to hidden",
        "-file": "Execute a script file.",
        "-BXOR":  "Performs bitwise XOR"
    },
    "COMMAND": {
        "Add-Content": "Adds content to the specified items, such as adding words to a file.",
        "Add-History": "Appends entries to the session history.",
        "Add-Member": "Adds custom properties and methods to an instance of a PowerShell object.",
        "Add-MpPreference": "Modifies settings for Windows Defender.",
        "Add-Type": "Adds a Microsoft .NET Framework type (a class) to a PowerShell session.",
        "Clear-Content": "Deletes the contents of an item, but does not delete the item.",
        "Clear-History": "Deletes entries from the command history.",
        "Clear-Host": "Clears the output screen of the current host.",
        "Clear-Item": "Clears the contents of an item, but does not delete the item.",
        "Clear-ItemProperty": "Clears the value of a property but does not delete the property.",
        "Clear-Variable": "Deletes the value of a variable.",
        "Compare-Object": "Compares two sets of objects.",
        "Compress-Archive": "Creates an archive, or zipped file, from specified files and folders.",
        "Connect-PSSession": "Reconnects to disconnected sessions.",
        "Convert-Path": "Converts a path from a PowerShell path to a PowerShell provider path.",
        "ConvertFrom-Csv": "Converts object properties in comma-separated value (CSV) format into CSV versions of the original objects.",
        "ConvertFrom-Json": "Converts a JSON-formatted string to a custom object.",
        "ConvertFrom-SddlString": "Converts a SDDL string to a custom object.",
        "ConvertFrom-StringData": "Converts a string containing one or more key and value pairs to a hash table.",
        "ConvertTo-Csv": "Converts objects into a series of comma-separated value (CSV) variable-length strings.",
        "ConvertTo-Html": "Converts Microsoft .NET Framework objects into HTML that can be displayed in a Web browser.",
        "ConvertTo-Json": "Converts an object to a JSON-formatted string.",
        "ConvertTo-Xml": "Creates an XML-based representation of an object.",
        "Copy-Item": "Copies an item from one location to another.",
        "Copy-ItemProperty": "Copies a property and value from a specified location to another location.",
        "Debug-Job": "Debugs a running background, remote, or PowerShell Workflow job.",
        "Debug-Process": "Debugs one or more processes running on the local computer.",
        "Debug-Runspace": "Starts an interactive debugging session with a runspace.",
        "Disable-PSBreakpoint": "Disables the breakpoints in the current console.",
        "Disable-PSSessionConfiguration": "Disables session configurations on the local computer.",
        "Disable-PSTrace": "Disables the Microsoft-Windows-PowerShell event provider logs.",
        "Disable-RunspaceDebug": "Disables debugging on one or more runspaces, and releases any pending debugger stop.",
        "Disconnect-PSSession": "Disconnects from a session.",
        "Enable-PSBreakpoint": "Enables the breakpoints in the current console.",
        "Enable-PSSessionConfiguration": "Enables the session configurations on the local computer.",
        "Enable-PSTrace": "Enables the Microsoft-Windows-PowerShell event provider logs.",
        "Enable-RunspaceDebug": "Enables debugging on runspaces where any breakpoint is preserved until a debugger is attached.",
        "Enter-PSHostProcess": "Connects to and enters into an interactive session with a local process.",
        "Enter-PSSession": "Starts an interactive session with a remote computer.",
        "Exit-PSHostProcess": "Closes an interactive session with a local process.",
        "Exit-PSSession": "Ends an interactive session with a remote computer.",
        "Expand-Archive": "Extracts files from a specified archive (zipped) file.",
        "Export-Alias": "Exports information about currently defined aliases to a file.",
        "Export-Clixml": "Creates an XML-based representation of an object or objects and stores it in a file.",
        "Export-Csv": "Converts objects into a series of comma-separated (CSV) strings and saves the strings in a CSV file.",
        "Export-FormatData": "Saves formatting data from the current session in a formatting file.",
        "Export-ModuleMember": "Specifies the module members that are exported.",
        "Export-PSSession": "Imports commands from another session and saves them in a PowerShell module.",
        "Find-Command": "Finds PowerShell commands in modules.",
        "Find-DscResource": "Finds a DSC resource.",
        "Find-Module": "Finds modules from an online gallery that match specified criteria.",
        "Find-Package": "Finds software packages in available package sources.",
        "Find-PackageProvider": "Returns a list of Package Management package providers available for installation.",
        "Find-RoleCapability": "Finds role capabilities in modules.",
        "Find-Script": "Finds a script.",
        "ForEach-Object": "Performs an operation against each item in a collection of input objects. Most of the times used for de-obfuscation of scripts.",
        "Format-Custom": "Uses a customized view to format the output.",
        "Format-Hex": "Displays a file or other input as hexadecimal.",
        "Format-List": "Formats the output as a list of properties in which each property appears on a new line.",
        "Format-Table": "Formats the output as a table.",
        "Format-Wide": "Formats objects as a wide table that displays only one property of each object.",
        "Get-Alias": "Gets the aliases for the current session.",
        "Get-ChildItem": "Gets the items and child items in one or more specified locations.",
        "Get-Command": "Gets all commands.",
        "Get-ComputerInfo": "Gets a consolidated object of system and operating system properties.",
        "Get-Content": "Gets the content of the item at the specified location.",
        "Get-Culture": "Gets the current culture set in the operating system.",
        "Get-Date": "Gets the current date and time.",
        "Get-Event": "Gets the events in the event queue.",
        "Get-EventSubscriber": "Gets the event subscribers in the current session.",
        "Get-ExecutionPolicy": "Gets the execution policies for the current session.",
        "Get-FileHash": "Computes the hash value for a file by using a specified hash algorithm.",
        "Get-FormatData": "Gets the formatting data in the current session.",
        "Get-Help": "Displays information about PowerShell commands and concepts.",
        "Get-History": "Gets a list of the commands entered during the current session.",
        "Get-Host": "Gets an object that represents the current host program.",
        "Get-InstalledModule": "Gets installed modules on a computer.",
        "Get-InstalledScript": "Gets an installed script.",
        "Get-Item": "Gets the item at the specified location.",
        "Get-ItemProperty": "Gets the properties of a specified item.",
        "Get-ItemPropertyValue": "Gets the value for one or more properties of a specified item.",
        "Get-Job": "Gets PowerShell background jobs that are running in the current session.",
        "Get-Location": "Gets information about the current working location or a location stack.",
        "Get-LogProperties": "Retrieves the properties of a Windows event log.",
        "Get-Member": "Gets the properties and methods of objects.",
        "Get-Module": "Gets the modules that have been imported or that can be imported into the current session.",
        "Get-MpComputerStatus": "Gets the status of antimalware software on the computer.",
        "Get-MpPreference": "Gets preferences for the Windows Defender scans and updates.",
        "Get-MpThreat": "Gets the history of threats detected on the computer.",
        "Get-MpThreatCatalog": "Gets known threats from the definitions catalog.",
        "Get-MpThreatDetection": "Gets active and past malware threats that Windows Defender detected.",
        "Get-PSBreakpoint": "Gets the breakpoints that are set in the current session.",
        "Get-PSCallStack": "Displays the current call stack.",
        "Get-PSDrive": "Gets drives in the current session.",
        "Get-PSHostProcessInfo": "Get information about the process that hosts the current PowerShell session.",
        "Get-PSProvider": "Gets information about the specified PowerShell provider.",
        "Get-PSReadLineKeyHandler": "Gets the key bindings for the PSReadLine module.",
        "Get-PSReadLineOption": "Gets values for the options that can be configured.",
        "Get-PSRepository": "Gets PowerShell repositories.",
        "Get-PSSession": "Gets the PowerShell sessions on local and remote computers.",
        "Get-PSSessionCapability": "Gets the capabilities of a specific user on a constrained session configuration.",
        "Get-PSSessionConfiguration": "Gets the registered session configurations on the computer.",
        "Get-Package": "Returns a list of all software packages that have been installed by using Package Management.",
        "Get-PackageProvider": "Returns a list of package providers that are connected to Package Management.",
        "Get-PackageSource": "Gets a list of package sources that are registered for a package provider.",
        "Get-Process": "Gets the processes that are running on the local computer or a remote computer.",
        "Get-Random": "Gets a random number, or selects objects randomly from a collection.",
        "Get-Runspace": "Gets active runspaces within a PowerShellhost process.",
        "Get-RunspaceDebug": "Shows runspace debugging options.",
        "Get-Service": "Gets the services on a local or remote computer.",
        "Get-TimeZone": "Gets the current time zone or a list of available time zones.",
        "Get-TraceSource": "Gets PowerShell components that are instrumented for tracing.",
        "Get-TypeData": "Gets the extended type data in the current session.",
        "Get-UICulture": "Gets the current UI culture settings in the operating system.",
        "Get-Unique": "Returns unique items from a sorted list.",
        "Get-Variable": "Gets the variables in the current console.",
        "Get-Verb": "Gets a list of approved verbs for PowerShell cmdlets.",
        "Get-WinEvent": "Gets events from event logs and event tracing log files on local and remote computers.",
        "Get-WmiObject": "Gets instances of WMI classes or information about the available classes.",
        "Group-Object": "Groups objects that contain the same value for specified properties.",
        "Import-Alias": "Imports an alias list from a file.",
        "Import-Clixml": "Imports a CLIXML file and creates corresponding objects in PowerShell.",
        "Import-Csv": "Creates table-like custom objects from the items in a CSV file.",
        "Import-LocalizedData": "Imports language-specific data into scripts and functions based on the UI culture that is selected for the operating system.",
        "Import-Module": "Adds modules to the current session.",
        "Import-PSSession": "Imports commands from another session into the current session.",
        "Import-PackageProvider": "Adds Package Management package providers to the current session.",
        "Import-PowerShellDataFile": "Imports values from a .PSD1 file without invoking its contents.",
        "Install-Module": "Downloads one or more modules from an online gallery, and installs them on the local computer.",
        "Install-Package": "Installs one or more software packages.",
        "Install-PackageProvider": "Installs one or more Package Management package providers.",
        "Install-Script": "Installs a script.",
        "Invoke-Command": "Runs commands on local and remote computers.",
        "Invoke-Expression": "Runs commands or expressions on the local computer.",
        "Invoke-History": "Runs commands from the session history.",
        "Invoke-Item": "Performs the default action on the specified item.",
        "Invoke-RestMethod": "Sends an HTTP or HTTPS request to a RESTful web service.",
        "Invoke-WebRequest": "Gets content from a web page on the Internet. Used for downloading files.",
        "Join-Path": "Combines a path and a child path into a single path.",
        "Measure-Command": "Measures the time it takes to run script blocks and cmdlets.",
        "Measure-Object": "Calculates the numeric properties of objects, and the characters, words, and lines in string objects, such as files of text.",
        "Move-Item": "Moves an item from one location to another.",
        "Move-ItemProperty": "Moves a property from one location to another.",
        "New-Alias": "Creates a new alias.",
        "New-Event": "Creates a new event.",
        "New-Guid": "Creates a GUID.",
        "New-Item": "Creates a new item.",
        "New-ItemProperty": "Creates a new property for an item and sets its value.",
        "New-Module": "Creates a new dynamic module that exists only in memory.",
        "New-ModuleManifest": "Creates a new module manifest.",
        "New-Object": "Creates an instance of a Microsoft .NET Framework or COM object.",
        "New-PSDrive": "Creates temporary and persistent mapped network drives.",
        "New-PSRoleCapabilityFile": "Creates a file that defines a set of capabilities to be exposed through a session configuration.",
        "New-PSSession": "Creates a persistent connection to a local or remote computer.",
        "New-PSSessionConfigurationFile": "Creates a file that defines a session configuration.",
        "New-PSSessionOption": "Creates an object that contains advanced options for a PSSession.",
        "New-PSTransportOption": "Creates an object that contains advanced options for a session configuration.",
        "New-ScriptFileInfo": "Creates a script file with metadata.",
        "New-Service": "Creates a new Windows service.",
        "New-TemporaryFile": "Creates a temporary file.",
        "New-TimeSpan": "Creates a TimeSpan object.",
        "New-Variable": "Creates a new variable.",
        "New-WinEvent": "Creates an ETW event for the specified event provider.",
        "Out-Default": "Sends the output to the default formatter and to the default output cmdlet.",
        "Out-File": "Sends output to a file.",
        "Out-Host": "Sends output to the command line.",
        "Out-Null": "Hides the output instead of sending it down the pipeline or displaying it.",
        "Out-String": "Sends objects to the host as a series of strings.",
        "PSConsoleHostReadLine": "The main entry point for PSReadLine.",
        "Pop-Location": "Changes the current location to the location most recently pushed onto the stack.",
        "Publish-Module": "Publishes a specified module from the local computer to an online gallery.",
        "Publish-Script": "Publishes a script from the local computer to an online gallery.",
        "Push-Location": "Adds the current location to the top of a location stack.",
        "Read-Host": "Reads a line of input from the console.",
        "Receive-Job": "Gets the results of the PowerShell background jobs in the current session.",
        "Receive-PSSession": "Gets results of commands in disconnected sessions.",
        "Register-ArgumentCompleter": "Registers a custom argument completer.",
        "Register-EngineEvent": "Subscribes to events that are generated by the PowerShell engine and by the New-Event cmdlet.",
        "Register-ObjectEvent": "Subscribes to the events that are generated by a Microsoft .NET Framework object.",
        "Register-PSRepository": "Registers a PowerShell repository.",
        "Register-PSSessionConfiguration": "Creates and registers a new session configuration.",
        "Register-PackageSource": "Adds a package source for a specified package provider.",
        "Remove-Event": "Deletes events from the event queue.",
        "Remove-Item": "Deletes the specified items.",
        "Remove-ItemProperty": "Deletes the property and its value from an item.",
        "Remove-Job": "Deletes a PowerShell background job.",
        "Remove-Module": "Removes modules from the current session.",
        "Remove-MpPreference": "Removes exclusions or default actions.",
        "Remove-MpThreat": "Removes active threats from a computer.",
        "Remove-PSBreakpoint": "Deletes breakpoints from the current console.",
        "Remove-PSDrive": "Deletes temporary PowerShell drives and disconnects mapped network drives.",
        "Remove-PSReadLineKeyHandler": "Removes a key binding.",
        "Remove-PSSession": "Closes one or more PowerShell sessions (PSSessions).",
        "Remove-TypeData": "Deletes extended types from the current session.",
        "Remove-Variable": "Deletes a variable and its value.",
        "Remove-WmiObject": "Deletes an instance of an existing Windows Management Instrumentation (WMI) class.",
        "Rename-Computer": "Renames a computer.",
        "Rename-Item": "Renames an item in a PowerShell provider namespace.",
        "Rename-ItemProperty": "Renames a property of an item.",
        "Resolve-Path": "Resolves the wildcard characters in a path, and displays the path contents.",
        "Restart-Computer": "Restarts (reboots) the operating system on local and remote computers.",
        "Restart-Service": "Stops and then starts one or more services.",
        "Resume-Service": "Resumes one or more suspended (paused) services.",
        "Save-Help": "Downloads and saves the newest help files to a file system directory.",
        "Save-Module": "Saves a module locally without installing it.",
        "Save-Package": "Saves packages to the local computer without installing them.",
        "Save-Script": "Saves a script.",
        "Select-Object": "Selects objects or object properties.",
        "Select-String": "Finds text in strings and files.",
        "Select-Xml": "Finds text in an XML string or document.",
        "Set-Alias": "Creates or changes an alias for a cmdlet or other command element in the current PowerShell session.",
        "Set-Content": "Writes or replaces the content in an item with new content.",
        "Set-Date": "Changes the system time on the computer to a time that you specify.",
        "Set-ExecutionPolicy": "Changes the user preference for the PowerShell execution policy.",
        "Set-Item": "Changes the value of an item to the value specified in the command.",
        "Set-ItemProperty": "Creates or changes the value of a property of an item.",
        "Set-Location": "Sets the current working location to a specified location.",
        "Set-LogProperties": "Changes the properties of a Windows event log.",
        "Set-MpPreference": "Configures preferences for Windows Defender scans and updates.",
        "Set-PSBreakpoint": "Sets a breakpoint on a line, command, or variable.",
        "Set-PSDebug": "Turns script debugging features on and off, sets the trace level, and toggles strict mode.",
        "Set-PSReadLineKeyHandler": "Binds keys to user-defined or PSReadLine-provided key handlers.",
        "Set-PSReadLineOption": "Customizes the behavior of command line editing in PSReadLine.",
        "Set-PSRepository": "Sets values for a registered repository.",
        "Set-PSSessionConfiguration": "Changes the properties of a registered session configuration.",
        "Set-PackageSource": "Replaces a package source for a specified package provider.",
        "Set-Service": "Starts, stops, and suspends a service, and changes its properties.",
        "Set-StrictMode": "Establishes and enforces coding rules in expressions, scripts, and script blocks.",
        "Set-TimeZone": "Sets the system time zone to a specified time zone.",
        "Set-TraceSource": "Configures, starts, and stops a trace of PowerShell components.",
        "Set-Variable": "Sets the value of a variable. Mostly used for obfuscation",
        "Set-WmiInstance": "Creates or updates an instance of an existing Windows Management Instrumentation (WMI) class.",
        "Sort-Object": "Sorts objects by property values.",
        "Split-Path": "Returns the specified part of a path.",
        "Start-Job": "Starts a PowerShell background job.",
        "Start-MpScan": "Starts a scan on a computer.",
        "Start-Process": "Starts one or more processes on the local computer.",
        "Start-Service": "Starts one or more stopped services.",
        "Start-Sleep": "Suspends the activity in a script or session for the specified period of time.",
        "Start-Transcript": "Creates a record of all or part of a PowerShell session to a text file.",
        "Stop-Computer": "Stops (shuts down) local and remote computers.",
        "Stop-Job": "Stops a PowerShell background job.",
        "Stop-Process": "Stops one or more running processes.",
        "Stop-Service": "Stops one or more running services.",
        "Stop-Transcript": "Stops a transcript.",
        "Suspend-Service": "Suspends (pauses) one or more running services.",
        "Tee-Object": "Saves command output in a file or variable and also sends it down the pipeline.",
        "Test-Connection": "Sends ICMP echo request packets (pings) to one or more computers.",
        "Test-ModuleManifest": "Verifies that a module manifest file accurately describes the contents of a module.",
        "Test-PSSessionConfigurationFile": "Verifies the keys and values in a session configuration file.",
        "Test-Path": "Determines whether all elements of a path exist.",
        "Test-ScriptFileInfo": "Validates a comment block for a script.",
        "Trace-Command": "Configures and starts a trace of the specified expression or command.",
        "Unblock-File": "Unblocks files that were downloaded from the Internet.",
        "Uninstall-Module": "Uninstalls a module.",
        "Uninstall-Package": "Uninstalls one or more software packages.",
        "Uninstall-Script": "Uninstalls a script file.",
        "Unregister-Event": "Cancels an event subscription.",
        "Unregister-PSRepository": "Unregisters a repository.",
        "Unregister-PSSessionConfiguration": "Deletes registered session configurations from the computer.",
        "Unregister-PackageSource": "Removes a registered package source.",
        "Update-FormatData": "Updates the formatting data in the current session.",
        "Update-Help": "Downloads and installs the newest help files on your computer.",
        "Update-Module": "Downloads and installs the newest version of specified modules from an online gallery to the local computer.",
        "Update-ModuleManifest": "Updates a module manifest file.",
        "Update-MpSignature": "Updates the antimalware definitions on a computer.",
        "Update-Script": "Updates a script.",
        "Update-ScriptFileInfo": "Updates information for a script.",
        "Update-TypeData": "Updates the extended type data in the session.",
        "Wait-Debugger": "Stops a script in the debugger before running the next statement in the script.",
        "Wait-Event": "Waits until a particular event is raised before continuing to run.",
        "Wait-Job": "Suppresses the command prompt until one or all of the PowerShell background jobs running in the session are completed.",
        "Wait-Process": "Waits for the processes to be stopped before accepting more input.",
        "Where-Object": "Selects objects from a collection based on their property values.",
        "Write-Debug": "Writes a debug message to the console.",
        "Write-Error": "Writes an object to the error stream.",
        "Write-Host": "Writes customized output to a host.",
        "Write-Information": "Specifies how PowerShell handles information stream data for a command.",
        "Write-Output": "Sends the specified objects to the next command in the pipeline. If the command is the last command in the pipeline, the objects are displayed in the console.",
        "Write-Progress": "Displays a progress bar within a PowerShell command window.",
        "Write-Verbose": "Writes text to the verbose message stream.",
        "Write-Warning": "Writes a warning message."
    },
    "NEW-OBJECT": {
        "net.webclient": ".NET class used for downloading files.",
        "system.reflection.assemblyname": ".NET Reflection API to invoke methods directly from the imported assemblies.",
        "byte[]": "Adds Object as Byte Array for current PowerShell session.",
        "system.net.networkinformation.ping": "Uses ping command in .NET",
        "Management.ManagementClass": "The members of this class enable you to access WMI data using a specific WMI class path.",
        "Win32_OperatingSystem": "The Win32_OperatingSystem WMI class represents a Windows-based operating system installed on a computer.",
        "WScript.Shell": "Adds WScript.Shell ComObject to possibly execute .VBS files"
    },
    "ADD-TYPE": {
        "Win32Functions": "Adds Win32 API Functions to current PowerShell session.",
        "System.Drawing": "The System.Drawing namespace provides access to GDI+ basic graphics functionality. Seen used by Invoke-PSImage"
    },
    "ARTIFACTS": {
        "Invoke-DllInjection": "Injects a Dll into the process ID of your choosing.",
        "Invoke-ReflectivePEInjection": "Reflectively loads a Windows PE file (DLL/EXE) in to the powershell process, or reflectively injects a DLL in to a remote process.",
        "Invoke-Shellcode": "Injects shellcode into the process ID of your choosing or within PowerShell locally.",
        "Out-EncodedCommand": "Compresses, Base-64 encodes, and outputs generated code to load a managed dll in memory.",
        "Invoke-WmiCommand": "Executes a PowerShell ScriptBlock on a target computer and returns its formatted output using WMI as a C2 channel.",
        "Out-EncryptedScript" : "Encrypts text files/scripts.",
        "Remove-Comments": "Strips comments and extra whitespace from a script.",
        "New-UserPersistenceOption": "Configure user-level persistence options for the Add-Persistence function.",
        "New-ElevatedPersistenceOption": "Configure elevated persistence options for the Add-Persistence function.",
        "Add-Persistence": "Add persistence capabilities to a script.",
        "Install-SSP": "Installs a security support provider (SSP) dll.",
        "Get-SecurityPackages": "Enumerates all loaded security packages (SSPs).",
        "Find-AVSignature": "Locates single Byte AV signatures utilizing the same method as DSplit from class101.",
        "Invoke-TokenManipulation": "Lists available logon tokens. Creates processes with other users logon tokens, and impersonates logon tokens in the current thread.",
        "Invoke-CredentialInjection": "Create logons with clear-text credentials without triggering a suspicious Event ID 4648 (Explicit Credential Logon).",
        "Invoke-NinjaCopy": "Copies a file from an NTFS partitioned volume by reading the raw volume and parsing the NTFS structures.",
        "Invoke-Mimikatz": "Reflectively loads Mimikatz 2.0 in memory using PowerShell. Can be used to dump credentials without writing anything to disk. Can be used for any functionality provided with Mimikatz.",
        "Get-Keystrokes": "Logs keys pressed, time and the active window.",
        "Get-GPPPassword": "Retrieves the plaintext password and other information for accounts pushed through Group Policy Preferences.",
        "Get-GPPAutologon": "Retrieves autologon username and password from registry.xml if pushed through Group Policy Preferences.",
        "Get-TimedScreenshot": "A function that takes screenshots at a regular interval and saves them to a folder.",
        "New-VolumeShadowCopy": "Creates a new volume shadow copy.",
        "Get-VolumeShadowCopy": "Lists the device paths of all local volume shadow copies.",
        "Mount-VolumeShadowCopy": "Mounts a volume shadow copy.",
        "Remove-VolumeShadowCopy": "Deletes a volume shadow copy.",
        "Get-VaultCredential": "Displays Windows vault credential objects including cleartext web credentials.",
        "Out-Minidump": "Generates a full-memory minidump of a process.",
        "Get-MicrophoneAudio": "Records audio from system microphone and saves to disk",
        "Set-MasterBootRecord": "Proof of concept code that overwrites the master boot record with the message of your choice.",
        "Set-CriticalProcess": "Causes your machine to blue screen upon exiting PowerShell.",
        "Invoke-Portscan": "Does a simple port scan using regular sockets, based (pretty) loosely on nmap.",
        "Get-HttpStatus": "Returns the HTTP Status Codes and full URL for specified paths when provided with a dictionary file.",
        "Invoke-ReverseDnsLookup": "Scans an IP address range for DNS PTR records.",
        "Set-DCShadowPermissions": "Modify AD objects to provide minimal permissions required for DCShadow.",
        "HTTP-Backdoor": "A backdoor which can receive instructions from third party websites and execute PowerShell scripts in memory.",
        "DNS_TXT_Pwnage": "A backdoor which can receive commands and PowerShell scripts from DNS TXT queries, execute them on a target, and be remotely controlled using the queries.",
        "Execute-OnTime": "A backdoor which can execute PowerShell scripts at a given time on a target.",
        "Gupt-Backdoor": "A backdoor which can receive commands and scripts from a WLAN SSID without connecting to it.",
        "Add-ScrnSaveBackdoor": "A backdoor which can use Windows screen saver for remote command and script execution.",
        "Invoke-ADSBackdoor": "A backdoor which can use alternate data streams and Windows Registry to achieve persistence.",
        "Add-RegBackdoor": "A backdoor which uses well known Debugger trick to execute payload with Sticky keys and Utilman (Windows key + U).",
        "Set-RemoteWMI": "Modify permissions of DCOM and WMI namespaces to allow access to a non-admin user.",
        "Set-RemotePSRemoting": "Modify permissions of PowerShell remoting to allow access to a non-admin user.",
        "Invoke-AmsiBypass": "Implementation of publicly known methods to bypass/avoid AMSI.",
        "Invoke-PsUACme": "Bypass UAC.",
        "Download-Execute-PS": "Download and execute a PowerShell script in memory.",
        "Download_Execute": "Download an executable in text format, convert it to an executable, and execute.",
        "Execute-Command-MSSQL": "Run PowerShell commands, native commands, or SQL commands on a MSSQL Server with sufficient privileges.",
        "Execute-DNSTXT-Code": "Execute shellcode in memory using DNS TXT queries.",
        "Out-RundllCommand": "Execute PowerShell commands and scripts or a reverse PowerShell session using rundll32.exe.",
        "Check-VM": "Check for a virtual machine.",
        "Copy-VSS": "Copy the SAM file using Volume Shadow Copy Service.",
        "Invoke-CredentialsPhish": "Trick a user into giving credentials in plain text.",
        "Get-Information": "Get juicy information from a target.",
        "Get-LSASecret": "Get LSA Secret from a target.",
        "Get-PassHashes": "Get password hashes from a target.",
        "Get-WLAN-Keys": "Get WLAN keys in plain text from a target.",
        "Invoke-MimikatzWdigestDowngrade": "Dump user passwords in plain on Windows 8.1 and Server 2012",
        "Get-PassHints": "Get password hints of Windows users from a target.",
        "Show-TargetScreen": "Connect back and Stream target screen using MJPEG.",
        "Invoke-Mimikittenz": "Extract juicy information from target process (like browsers) memory using regex.",
        "Invoke-SSIDExfil": "Exfiltrate information like user credentials, using WLAN SSID.",
        "Invoke-SessionGopher": "Identify admin jump-boxes and/or computers used to access Unix machines.",
        "Invoke-Interceptor": "A local HTTPS proxy for MITM attacks.",
        "Create-MultipleSessions": "Check credentials on multiple computers and create PSSessions.",
        "Brute-Force": "Brute force FTP, Active Directory, MSSQL, and Sharepoint.",
        "Port-Scan": "A handy port scanner.",
        "Invoke-PsGcat": "Send commands and scripts to specifed Gmail account to be executed by Invoke-PsGcatAgent",
        "Invoke-PsGcatAgent": "Execute commands and scripts sent by Invoke-PsGcat.",
        "Invoke-PowerShellTcp": "An interactive PowerShell reverse connect or bind shell",
        "Invoke-PowerShellTcpOneLine": "Stripped down version of Invoke-PowerShellTcp. Also contains, a skeleton version which could fit in two tweets.",
        "Invoke-PowerShellTcpOneLineBind": "Bind version of Invoke-PowerShellTcpOneLine.",
        "Invoke-PowerShellUdp": "An interactive PowerShell reverse connect or bind shell over UDP",
        "Invoke-PowerShellUdpOneLine": "Stripped down version of Invoke-PowerShellUdp.",
        "Invoke-PoshRatHttps": "Reverse interactive PowerShell over HTTPS.",
        "Invoke-PoshRatHttp": "Reverse interactive PowerShell over HTTP.",
        "Remove-PoshRat": "Clean the system after using Invoke-PoshRatHttps",
        "Invoke-PowerShellWmi": "Interactive PowerShell using WMI.",
        "Invoke-PowerShellIcmp": "An interactive PowerShell reverse shell over ICMP.",
        "Invoke-JSRatRundll": "An interactive PowerShell reverse shell over HTTP using rundll32.exe.",
        "Invoke-JSRatRegsvr": "An interactive PowerShell reverse shell over HTTP using regsvr32.exe.",
        "Invoke-PSImage": "Embeds a PowerShell script in the pixels of a PNG file and generates a oneliner to execute.",
        "VirtualAlloc": "Adds VirtualAlloc to a PowerShell session. May be used for shellcode injection.",
        "CreateThread": "Adds CreateThread to a PowerShell session. May be used for shellcode injection.",
        "Invoke-WebRequest": "Gets content from a web page on the Internet. Used for downloading files.",
        "Start-BitsTransfer": "May be used for downloading files.",
        ".DownloadFile": "May download files remotely.",
        "IEX":  "Invokes Expression.",
        "Start-Process": "May attempt to execute a process.",
        "Remove-item": "May attempt to delete a file.",
        "memset": "Adds CreateThread to a PowerShell session. May be used for shellcode injection.",
        "cmd /c": "May execute commands using cmd.exe",
        ".OpenRead": "May open a readable stream for the data downloaded from a resource with the URI specified as a String.",
        "Invoke-Item": "Performs the default action on the specified item. For example, it runs an executable file or opens a document file in the application associated with the document file type.",
        "WScript.Shell": "May execute a .VBS file",
        "(GeT-WMIObjECt Win32_OperatingSystem).osarchitecture.contains('64')": "Checks if OS is 64-bit",
        "(GeT-WMIObjECt Win32_OperatingSystem).osarchitecture.contains('32')": "Checks if OS is 32-bit",
        "185.128.43.62": "Ip address related to PowerGhost malware",
        "192.74.245.97": "Ip address related to PowerGhost malware",
        "info.7h4uk.com": "Domain used by PowerGhost malware",
        "update.7h4uk.com": "Domain used by PowerGhost malware",
        "cohernece.exe": "DDOS module of PowerGhost malware",
        "Killbot": "Runs Killbot module of PowerGhost malware",
        "netstat -anop tcp": "Using netstat to gather all tcp connections",
        "PingCastle.Scanners.m17sc": "Searches for ms17-010 vulnerable systems in the network using PingCastle",
        "Remove-WmiObject": "Deletes an instance of an existing Windows Management Instrumentation (WMI) class.",
        "Stop-Process": "Stops one or more running processes.",
        "Netsh": "May use Netsh to modify network configurations such as adding network policies, etc.",
        "SchTasks": "May use task scheduler to create and manage tasks",
        "PowerCfg": "May use PowerCfg to modify power system settings",
        "FromBase64String": "Use to decode Base64 encoded strings",
        "Set-MpPreference -DisableRealtimeMonitoring": "Disables Realtime Monitoring for Windows Defender.",
        "-BAND":  "Performs bitwise AND",
        "-BNOT":  "Performs bitwise NOT",
        "-BOR":  "Performs bitwise OR",
        "-SHL":  "Shifts bytes to the left",
        "-SHR":  "Shifts bytes to the right"
        }
    }

